src/main/java/ru/vk/itmo/test/vadimershov/wrk/result2/get/30000/wrk.txt
./wrk -d 60 -t 10 -c 250 -R 30000 -L -s ./get.lua http://localhost:8080/v0/entry
Running 1m test @ http://localhost:8080/v0/entry
  10 threads and 250 connections
  Thread calibration: mean lat.: 23.917ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 26.344ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 21.703ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 30.399ms, rate sampling interval: 83ms
  Thread calibration: mean lat.: 27.631ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 26.740ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 31.320ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 29.129ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 33.180ms, rate sampling interval: 99ms
  Thread calibration: mean lat.: 34.782ms, rate sampling interval: 150ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms  553.72us  14.02ms   68.28%
    Req/Sec     3.13k   248.38     5.40k    74.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.55ms
 90.000%    1.86ms
 99.000%    2.44ms
 99.900%    5.48ms
 99.990%    8.24ms
 99.999%   10.58ms
100.000%   14.03ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.061     0.000000            1         1.00
       0.507     0.100000       149833         1.11
       0.684     0.200000       300008         1.25
       0.839     0.300000       449351         1.43
       0.989     0.400000       598783         1.67
       1.139     0.500000       748371         2.00
       1.217     0.550000       823742         2.22
       1.295     0.600000       897962         2.50
       1.375     0.650000       972562         2.86
       1.459     0.700000      1047604         3.33
       1.546     0.750000      1122639         4.00
       1.591     0.775000      1159736         4.44
       1.638     0.800000      1197253         5.00
       1.687     0.825000      1234625         5.71
       1.740     0.850000      1272236         6.67
       1.797     0.875000      1309338         8.00
       1.829     0.887500      1328274         8.89
       1.863     0.900000      1346962        10.00
       1.900     0.912500      1365465        11.43
       1.942     0.925000      1384172        13.33
       1.990     0.937500      1402840        16.00
       2.017     0.943750      1412098        17.78
       2.049     0.950000      1421899        20.00
       2.081     0.956250      1430841        22.86
       2.119     0.962500      1440292        26.67
       2.163     0.968750      1449543        32.00
       2.189     0.971875      1454323        35.56
       2.217     0.975000      1458928        40.00
       2.249     0.978125      1463614        45.71
       2.285     0.981250      1468147        53.33
       2.329     0.984375      1472881        64.00
       2.355     0.985938      1475234        71.11
       2.385     0.987500      1477648        80.00
       2.417     0.989062      1479879        91.43
       2.457     0.990625      1482250       106.67
       2.505     0.992188      1484579       128.00
       2.533     0.992969      1485719       142.22
       2.567     0.993750      1486890       160.00
       2.605     0.994531      1488038       182.86
       2.653     0.995313      1489176       213.33
       2.715     0.996094      1490355       256.00
       2.757     0.996484      1490943       284.44
       2.811     0.996875      1491515       320.00
       2.881     0.997266      1492096       365.71
       2.993     0.997656      1492686       426.67
       3.211     0.998047      1493264       512.00
       3.501     0.998242      1493557       568.89
       3.975     0.998437      1493849       640.00
       4.495     0.998633      1494145       731.43
       5.067     0.998828      1494434       853.33
       5.531     0.999023      1494727      1024.00
       5.755     0.999121      1494871      1137.78
       5.967     0.999219      1495022      1280.00
       6.207     0.999316      1495168      1462.86
       6.431     0.999414      1495312      1706.67
       6.639     0.999512      1495457      2048.00
       6.791     0.999561      1495531      2275.56
       6.931     0.999609      1495602      2560.00
       7.091     0.999658      1495676      2925.71
       7.223     0.999707      1495749      3413.33
       7.383     0.999756      1495823      4096.00
       7.479     0.999780      1495858      4551.11
       7.575     0.999805      1495895      5120.00
       7.727     0.999829      1495931      5851.43
       7.871     0.999854      1495967      6826.67
       8.051     0.999878      1496004      8192.00
       8.171     0.999890      1496022      9102.22
       8.247     0.999902      1496040     10240.00
       8.415     0.999915      1496060     11702.86
       8.535     0.999927      1496078     13653.33
       8.775     0.999939      1496095     16384.00
       8.863     0.999945      1496104     18204.44
       8.991     0.999951      1496113     20480.00
       9.143     0.999957      1496124     23405.71
       9.279     0.999963      1496132     27306.67
       9.543     0.999969      1496141     32768.00
       9.775     0.999973      1496145     36408.89
       9.991     0.999976      1496151     40960.00
      10.223     0.999979      1496155     46811.43
      10.303     0.999982      1496159     54613.33
      10.455     0.999985      1496164     65536.00
      10.495     0.999986      1496166     72817.78
      10.535     0.999988      1496168     81920.00
      10.583     0.999989      1496171     93622.86
      10.639     0.999991      1496174    109226.67
      10.671     0.999992      1496175    131072.00
      10.751     0.999993      1496176    145635.56
      10.775     0.999994      1496177    163840.00
      11.055     0.999995      1496179    187245.71
      11.127     0.999995      1496181    218453.33
      11.127     0.999996      1496181    262144.00
      11.127     0.999997      1496181    291271.11
      11.567     0.999997      1496182    327680.00
      12.023     0.999997      1496183    374491.43
      12.023     0.999998      1496183    436906.67
      12.183     0.999998      1496184    524288.00
      12.183     0.999998      1496184    582542.22
      12.183     0.999998      1496184    655360.00
      12.495     0.999999      1496185    748982.86
      12.495     0.999999      1496185    873813.33
      12.495     0.999999      1496185   1048576.00
      12.495     0.999999      1496185   1165084.44
      12.495     0.999999      1496185   1310720.00
      14.031     0.999999      1496186   1497965.71
      14.031     1.000000      1496186          inf
#[Mean    =        1.177, StdDeviation   =        0.554]
#[Max     =       14.024, Total count    =      1496186]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1790037 requests in 1.00m, 116.09MB read
  Non-2xx or 3xx responses: 1840
Requests/sec:  29834.83
Transfer/sec:      1.93MB